Revit 2026 API

# AdvancedWoodWoodPoreColorPower Property

---

The property labeled "Power to compute pore color" from the "AdvancedWood" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string WoodPoreColorPower { get; }
```
```vb
Public Shared ReadOnly Property WoodPoreColorPower As String
	Get
```
```cpp
public:
static property String^ WoodPoreColorPower {
	String^ get ();
}
```
```fsharp
static member WoodPoreColorPower : string with get
```

#### Property Value

String

This property is of type "AssetPropertyDouble".

#### Reference

AdvancedWood Class

Autodesk.Revit.DB.Visual Namespace